# Используем официальный образ Node.js в качестве базового
FROM node:18

# Устанавливаем рабочую директорию в контейнере
WORKDIR /usr/src/app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости, только для продакшена
RUN npm install --only=production

# Копируем остальной собранный код в рабочую директорию
COPY dist/ .

# Открываем порт 3000 для приложения
EXPOSE 3000

# Определяем команду для запуска приложения
CMD ["node", "server.js"]
